models/Modes.php

    public static function findById($id){
        return self::findOne(['user_id' => $id]);
---
SELECT * FROM `modes` WHERE `user_id`=20